count_try=3
password=123
for i in range(count_try):
    pass_in = input('input password: ')
    if pass_in == password :
        print ('welcome')
        break
    else :
        print ('try again')
else :
        print ('no welcome')

        1)У
        вас
        есть
        строка
        my_string = '0123456789'.
        Сгенерировать
        целые
        числа(тип
        int) от
        0
        до
        99
        и
        распечатать
        их.
        Задание
        нужно
        выполнить
        ТОЛЬКО
        через
        цикл
        в
        цикле(См.пример
        выше) и
        приведение
        типов.
        Генерирование
        через
        range
        или
        другие
        "фишки"
        я
        засчитывать
        не
        буду ))
